tap "homebrew/bundle"
tap "homebrew/services"

# Core
#brew "node"              # Estoy usando nvm de momento, hay problemas de nvm con homebrew por eso hago la instalacion directa.
#brew "smartmontools"     # para verificar el estado de los discos
cask "warp"               # Modern terminal application for macOS
cask "runjs"              # JavaScript playground that auto-evaluates as code is typed
cask "postman"            # Collaboration platform for API development
cask "dbeaver-community"  # Universal database tool for developers and database administrators
cask "visual-studio-code"

# Java
brew "maven"
brew "openjdk@17", link: false
brew "openjdk@21", link: true

# Fun
cask "spotify"
cask "discord"

# Tools
cask "notion"             # All-in-one workspace
cask "aldente"            # Menu bar tool to limit maximum charging percentage
cask "keka"               # File archiver
cask "rectangle"          # Move and resize windows using keyboard shortcuts or snap areas
cask "stats"              # System monitor for the menu bar
cask "obsidian"           # Knowledge base that works on local Markdown files
cask "google-chrome"
cask "microsoft-edge"